app/controllers/books_controller.rb

INSERT INTO "books" ("title", "text", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "cocacola"], ["text", ".vnnvdfjoij eo iop kqtop43ojqjfq ojop qjopfjkopijwakj"], ["created_at", "2018-05-07 06:57:51.543896"], ["updated_at", "2018-05-07 06:57:51.543896"], ["user_id", 3]]
---
  	def create

  		@book = Book.new(book_params)
  		@book.user_id = current_user.id
   		if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
	def find_user
		@book= Book.find(params[:id])